// Вася работает программистом и получает 50$ за каждые 100 строк кода
//  За каждое третье опоздание на работу Васю штрафуют на 20$.Реализовать меню :
// ■ пользователь вводит желаемый доход Васи и количество
// опозданий, посчитать, сколько строк кода ему надонаписать;
// ■ пользователь вводит количество строк кода, написанное
// Васей и желаемый объем зарплаты.Посчитать, сколько
// раз Вася может опоздать;
// ■ пользователь вводит количество строк кода и количество
// опозданий, определить, сколько денег заплатят Васе и
// заплатят ли вообще


#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}


